netsuite/netsuite-connector/netsuite-connector-1.0.0/org.wso2.carbon.connector/src/test/resources/artifacts/ESB/config/soapRequests/netsuite/api_initializeList_mandatory.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" 
xmlns:urn="urn:messages_2014_1.platform.webservices.netsuite.com" 
xmlns:urn1="urn:core_2014_1.platform.webservices.netsuite.com">
   <soapenv:Header>
      <urn:preferences>
         <urn:warningAsError></urn:warningAsError>
         <urn:disableMandatoryCustomFieldValidation></urn:disableMandatoryCustomFieldValidation>
         <urn:disableSystemNotesForCustomFields></urn:disableSystemNotesForCustomFields>
         <urn:ignoreReadOnlyFields></urn:ignoreReadOnlyFields>
      </urn:preferences>
      <urn:partnerInfo>
         <urn:partnerId></urn:partnerId>
      </urn:partnerInfo>
      <urn:applicationInfo>
         <urn:applicationId></urn:applicationId>
      </urn:applicationInfo>
      <urn:passport>
            <urn1:email>%s(email)</urn1:email>
            <urn1:password>%s(password)</urn1:password>
            <urn1:account>%s(account)</urn1:account>
         <urn1:role>
            <urn1:name></urn1:name>
         </urn1:role>
      </urn:passport>
   </soapenv:Header>
   <soapenv:Body>
      <urn:initializeList>
         <platformMsgs:initializeRecord xmlns:platformMsgs="urn:messages_2014_1.platform.webservices.netsuite.com" xmlns:platformCore="urn:core_2014_1.platform.webservices.netsuite.com" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
            <platformCore:type>customerPayment</platformCore:type>
           <platformCore:reference type="customer" internalId="%s(addListMandatoryInternalId)"/>
         </platformMsgs:initializeRecord>
      </urn:initializeList>
   </soapenv:Body>
</soapenv:Envelope>
